const idol_kana = {'アスラン=BBⅡ世': 'あすらんべるぜびゅーとにせい',
 'アナスタシア': 'あなすたしあ',
 'イヴ・サンタクロース': 'いゔ・さんたくろーす',
 'エミリー': 'えみりーすちゅあーと',
 'キャシー・グラハム': 'きゃしー・ぐらはむ',
 'クラリス': 'くらりす',
 'ケイト': 'けいと',
 'サイネリア': 'さいねりあ',
 'ジュリア': 'じゅりあ',
 'ナターリア': 'なたーりあ',
 'ピエール': 'ぴえーる',
 'ヘレン': 'へれん',
 'メアリー・コクラン': 'めありー・こくらん',
 'ライラ': 'らいら',
 'ロコ': 'ろこ',
 '一ノ瀬志希': 'いちのせしき',
 '七尾百合子': 'ななおゆりこ',
 '三好紗南': 'みよしさな',
 '三峰結華': 'みつみねゆいか',
 '三村かな子': 'みむらかなこ',
 '三条ともみ': 'さんじょうともみ',
 '三浦あずさ': 'みうらあずさ',
 '三船美優': 'みふねみゆ',
 '上条春菜': 'かみじょうはるな',
 '上田鈴帆': 'うえだすずほ',
 '並木芽衣子': 'なみきめいこ',
 '中谷育': 'なかたにいく',
 '中野有香': 'なかのゆか',
 '丹羽仁美': 'にわひとみ',
 '久川凪': 'ひさかわなぎ',
 '久川颯': 'ひさかわはやて',
 '乙倉悠貴': 'おとくらゆうき',
 '九十九一希': 'つくもかずき',
 '二宮飛鳥': 'にのみやあすか',
 '二階堂千鶴': 'にかいどうちづる',
 '五十嵐響子': 'いがらしきょうこ',
 '井村雪菜': 'いむらせつな',
 '今井加奈': 'いまいかな',
 '仙崎恵磨': 'せんざきえま',
 '伊吹翼': 'いぶきつばさ',
 '伊瀬谷四季': 'いせやしき',
 '伊集院北斗': 'いじゅういんほくと',
 '伊集院惠': 'いじゅういんめぐみ',
 '佐々木千枝': 'ささきちえ',
 '佐久間まゆ': 'さくままゆ',
 '佐城雪美': 'さじょうゆきみ',
 '佐竹美奈子': 'さたけみなこ',
 '佐藤心': 'さとうしん',
 '依田芳乃': 'よりたよしの',
 '信玄誠司': 'しんげんせいじ',
 '兜大吾': 'かぶとだいご',
 '八宮めぐる': 'はちみやめぐる',
 '八神マキノ': 'やがみまきの',
 '兵藤レナ': 'ひょうどうれな',
 '円城寺道流': 'えんじょうじみちる',
 '冬美旬': 'ふゆみじゅん',
 '冴島清美': 'さえじまきよみ',
 '前川みく': 'まえかわみく',
 '北上麗花': 'きたかみれいか',
 '北川真尋': 'きたがわまひろ',
 '北村想楽': 'きたむらそら',
 '北条加蓮': 'ほうじょうかれん',
 '北沢志保': 'きたざわしほ',
 '十時愛梨': 'とときあいり',
 '南条光': 'なんじょうひかる',
 '卯月巻緒': 'うづきまきお',
 '原田美世': 'はらだみよ',
 '及川雫': 'おいかわしずく',
 '双海亜美': 'ふたみあみ',
 '双海真美': 'ふたみまみ',
 '双葉杏': 'ふたばあんず',
 '古澤頼子': 'ふるさわよりこ',
 '古論クリス': 'ころんくりす',
 '古賀小春': 'こがこはる',
 '吉岡沙紀': 'よしおかさき',
 '向井拓海': 'むかいたくみ',
 '周防桃子': 'すおうももこ',
 '和久井留美': 'わくいるみ',
 '和泉愛依': 'いずみめい',
 '喜多日菜子': 'きたひなこ',
 '喜多見柚': 'きたみゆず',
 '四条貴音': 'しじょうたかね',
 '園田智代子': 'そのだちよこ',
 '土屋亜子': 'つちやあこ',
 '城ヶ崎美嘉': 'じょうがさきみか',
 '城ヶ崎莉嘉': 'じょうがさきりか',
 '堀裕子': 'ほりゆうこ',
 '塩見周子': 'しおみしゅうこ',
 '多田李衣菜': 'ただりいな',
 '夢見りあむ': 'ゆめみりあむ',
 '大原みちる': 'おおはらみちる',
 '大和亜季': 'やまとあき',
 '大崎甘奈': 'おおさきあまな',
 '大崎甜花': 'おおさきてんか',
 '大槻唯': 'おおつきゆい',
 '大河タケル': 'たいがたける',
 '大沼くるみ': 'おおぬまくるみ',
 '大石泉': 'おおいしいずみ',
 '大神環': 'おおがみたまき',
 '大西由里子': 'おおにしゆりこ',
 '天ヶ瀬冬馬': 'あまがせとうま',
 '天海春香': 'あまみはるか',
 '天空橋朋花': 'てんくうばしともか',
 '天道輝': 'てんどうてる',
 '太田優': 'おおたゆう',
 '奥山沙織': 'おくやまさおり',
 '如月千早': 'きさらぎちはや',
 '姫川友紀': 'ひめかわゆき',
 '姫野かのん': 'ひめのかのん',
 '安斎都': 'あんざいみやこ',
 '安部菜々': 'あべなな',
 '宮尾美也': 'みやおみや',
 '宮本フレデリカ': 'みやもとふれでりか',
 '小室千奈美': 'こむろちなみ',
 '小宮果穂': 'こみやかほ',
 '小日向美穂': 'こひなたみほ',
 '小早川紗枝': 'こばやかわさえ',
 '小松伊吹': 'こまついぶき',
 '小関麗奈': 'こせきれいな',
 '山下次郎': 'やましたじろう',
 '岡崎泰葉': 'おかざきやすは',
 '岡村直央': 'おかむらなお',
 '岸部彩華': 'きしべあやか',
 '島原エレナ': 'しまばらえれな',
 '島村卯月': 'しまむらうづき',
 '川島瑞樹': 'かわしまみずき',
 '工藤忍': 'くどうしのぶ',
 '市原仁奈': 'いちはらにな',
 '市川雛菜': 'いちかわひなな',
 '幽谷霧子': 'ゆうこくきりこ',
 '御手洗翔太': 'みたらいしょうた',
 '徳川まつり': 'とくがわまつり',
 '愛野渚': 'あいのなぎさ',
 '成宮由愛': 'なるみやゆめ',
 '我那覇響': 'がなはひびき',
 '所恵美': 'ところめぐみ',
 '持田亜里沙': 'もちだありさ',
 '握野英雄': 'あくのひでお',
 '斉藤洋子': 'さいとうようこ',
 '新田美波': 'にったみなみ',
 '日下部若葉': 'くさかべわかば',
 '日野茜': 'ひのあかね',
 '日高愛': 'ひだかあい',
 '早坂美玲': 'はやさかみれい',
 '星井美希': 'ほしいみき',
 '星輝子': 'ほししょうこ',
 '春日未来': 'かすがみらい',
 '最上静香': 'もがみしずか',
 '月宮雅': 'つきみやみやび',
 '月岡恋鐘': 'つきおかこがね',
 '有栖川夏葉': 'ありすがわなつは',
 '有浦柑奈': 'ありうらかんな',
 '服部瞳子': 'はっとりとうこ',
 '望月杏奈': 'もちづきあんな',
 '望月聖': 'もちづきひじり',
 '朝比奈りん': 'あさひなりん',
 '木下ひなた': 'きのしたひなた',
 '木場真奈美': 'きばまなみ',
 '木村夏樹': 'きむらなつき',
 '木村龍': 'きむらりゅう',
 '本田未央': 'ほんだみお',
 '杉坂海': 'すぎさかうみ',
 '村上巴': 'むらかみともえ',
 '村松さくら': 'むらまつさくら',
 '杜野凛世': 'もりのりんぜ',
 '東豪寺麗華': 'とうごうじれいか',
 '東郷あい': 'とうごうあい',
 '東雲荘一郎': 'しののめそういちろう',
 '松原早耶': 'まつばらさや',
 '松尾千鶴': 'まつおちづる',
 '松山久美子': 'まつやまくみこ',
 '松本沙理奈': 'まつもとさりな',
 '松永涼': 'まつながりょう',
 '松田亜利沙': 'まつだありさ',
 '柊志乃': 'ひいらぎしの',
 '柏木翼': 'かしわぎつばさ',
 '柳清良': 'やなぎきよら',
 '柳瀬美由紀': 'やなせみゆき',
 '栗原ネネ': 'くりはらねね',
 '桃井あずき': 'ももいあずき',
 '桐生つかさ': 'きりゅうつかさ',
 '桐野アヤ': 'きりのあや',
 '桑山千雪': 'くわやまちゆき',
 '桜井夢子': 'さくらいゆめこ',
 '桜守歌織': 'さくらもりかおり',
 '桜庭薫': 'さくらばかおる',
 '梅木音葉': 'うめきおとは',
 '棟方愛海': 'むなかたあつみ',
 '森久保乃々': 'もりくぼのの',
 '椎名法子': 'しいなのりこ',
 '楊菲菲': 'やおふぇいふぇい',
 '榊原里美': 'さかきばらさとみ',
 '榊夏来': 'さかきなつき',
 '槙原志保': 'まきはらしほ',
 '樋口円香': 'ひぐちまどか',
 '横山千佳': 'よこやまちか',
 '横山奈緒': 'よこやまなお',
 '橘ありす': 'たちばなありす',
 '橘志狼': 'たちばなしろう',
 '櫻井桃華': 'さくらいももか',
 '櫻木真乃': 'さくらぎまの',
 '氏家むつみ': 'うじいえむつみ',
 '水嶋咲': 'みずしまさき',
 '水木聖來': 'みずきせいら',
 '水本ゆかり': 'みずもとゆかり',
 '水瀬伊織': 'みなせいおり',
 '水谷絵理': 'みずたにえり',
 '水野翠': 'みずのみどり',
 '永吉昴': 'ながよしすばる',
 '江上椿': 'えがみつばき',
 '池袋晶葉': 'いけぶくろあきは',
 '沢田麻理菜': 'さわだまりな',
 '浅倉透': 'あさくらとおる',
 '浅利七海': 'あさりななみ',
 '浅野風香': 'あさのふうか',
 '浜口あやめ': 'はまぐちあやめ',
 '浜川愛結奈': 'はまかわあゆな',
 '海老原菜帆': 'えびはらなほ',
 '涼宮星花': 'すずみやせいか',
 '清澄九郎': 'きよすみくろう',
 '渋谷凛': 'しぶやりん',
 '渡辺みのり': 'わたなべみのり',
 '瀬名詩織': 'せなしおり',
 '片桐早苗': 'かたぎりさなえ',
 '牙崎漣': 'きざきれん',
 '猫柳キリオ': 'ねこやなぎきりお',
 '田中摩美々': 'たなかまみみ',
 '田中琴葉': 'たなかことは',
 '白坂小梅': 'しらさかこうめ',
 '白瀬咲耶': 'しらせさくや',
 '白石紬': 'しらいしつむぎ',
 '白菊ほたる': 'しらぎくほたる',
 '白雪千夜': 'しらゆきちよ',
 '百瀬莉緒': 'ももせりお',
 '的場梨沙': 'まとばりさ',
 '相原雪乃': 'あいはらゆきの',
 '相川千夏': 'あいかわちなつ',
 '相葉夕美': 'あいばゆみ',
 '相馬夏美': 'そうまなつみ',
 '真壁瑞希': 'まかべみずき',
 '真鍋いつき': 'まなべいつき',
 '矢口美羽': 'やぐちみう',
 '矢吹可奈': 'やぶきかな',
 '砂塚あきら': 'すなづかあきら',
 '硲道夫': 'はざまみちお',
 '神崎蘭子': 'かんざきらんこ',
 '神楽麗': 'かぐられい',
 '神谷奈緒': 'かみやなお',
 '神谷幸広': 'かみやゆきひろ',
 '福丸小糸': 'ふくまるこいと',
 '福山舞': 'ふくやままい',
 '福田のり子': 'ふくだのりこ',
 '秋山隼人': 'あきやまはやと',
 '秋月律子': 'あきづきりつこ',
 '秋月涼': 'あきづきりょう',
 '箱崎星梨花': 'はこざきせりか',
 '篠原礼': 'しのはられい',
 '篠宮可憐': 'しのみやかれん',
 '紅井朱雀': 'あかいすざく',
 '結城晴': 'ゆうきはる',
 '綾瀬穂乃香': 'あやせほのか',
 '緒方智絵里': 'おがたちえり',
 '脇山珠美': 'わきやまたまみ',
 '舞浜歩': 'まいはまあゆむ',
 '舞田類': 'まいたるい',
 '芹沢あさひ': 'せりざわあさひ',
 '若林智香': 'わかばやしともか',
 '若里春名': 'わかざとはるな',
 '荒木比奈': 'あらきひな',
 '菊地真': 'きくちまこと',
 '華村翔真': 'はなむらしょうま',
 '萩原雪歩': 'はぎわらゆきほ',
 '葛之葉雨彦': 'くずのはあめひこ',
 '蒼井享介': 'あおいきょうすけ',
 '蒼井悠介': 'あおいゆうすけ',
 '藤原肇': 'ふじわらはじめ',
 '藤居朋': 'ふじいとも',
 '藤本里奈': 'ふじもとりな',
 '衛藤美紗希': 'えとうみさき',
 '西園寺琴歌': 'さいおんじことか',
 '西城樹里': 'さいじょうじゅり',
 '西島櫂': 'にしじまかい',
 '西川保奈美': 'にしかわほなみ',
 '諸星きらり': 'もろぼしきらり',
 '豊川風花': 'とよかわふうか',
 '財前時子': 'ざいぜんときこ',
 '赤城みりあ': 'あかぎみりあ',
 '赤西瑛梨華': 'あかにしえりか',
 '輿水幸子': 'こしみずさちこ',
 '辻野あかり': 'つじのあかり',
 '速水奏': 'はやみかなで',
 '遊佐こずえ': 'ゆさこずえ',
 '道明寺歌鈴': 'どうみょうじかりん',
 '都築圭': 'つづきけい',
 '野々原茜': 'ののはらあかね',
 '野々村そら': 'ののむらそら',
 '長富蓮実': 'ながとみはすみ',
 '間中美里': 'まなかみさと',
 '関裕美': 'せきひろみ',
 '難波笑美': 'なんばえみ',
 '風野灯織': 'かざのひおり',
 '首藤葵': 'しゅとうあおい',
 '馬場このみ': 'ばばこのみ',
 '高坂海美': 'こうさかうみ',
 '高垣楓': 'たかがきかえで',
 '高山紗代子': 'たかやまさよこ',
 '高峯のあ': 'たかみねのあ',
 '高森藍子': 'たかもりあいこ',
 '高槻やよい': 'たかつきやよい',
 '高橋礼子': 'たかはしれいこ',
 '鷹城恭二': 'たかじょうきょうじ',
 '鷹富士茄子': 'たかふじかこ',
 '鷺沢文香': 'さぎさわふみか',
 '黒埼ちとせ': 'くろさきちとせ',
 '黒川千秋': 'くろかわちあき',
 '黒野玄武': 'くろのげんぶ',
 '黛冬優子': 'まゆずみふゆこ',
 '龍崎薫': 'りゅうざきかおる'};

//アイドル名のaiueoデータを作成
let idol_aiueo = {};
for (let name in idol_kana){
  idol_aiueo[name] = kana_to_aiueo(idol_kana[name]);
}

//ひらがなをaiueoに変換
function kana_to_aiueo(text){
  let aiueo = text;
  aiueo = aiueo.replace(/[あかさたなはまやらわがざだばぱゃ]/g, 'a');
  aiueo = aiueo.replace(/[いきしちにひみりぎじぢびぴ]/g, 'i');
  aiueo = aiueo.replace(/[うくすつぬふむゆるゔぐずづぶぷゅ]/g, 'u');
  aiueo = aiueo.replace(/[えけせてねへめれげぜでべぺ]/g, 'e');
  aiueo = aiueo.replace(/[おこそとのほもよろをごぞどぼぽょ]/g, 'o');
  aiueo = aiueo.replace(/[^aiueon]/g, '');

  return aiueo;

}

function generate_in(){

  const text = document.getElementById('textarea').value;

  //ひと文字ずつ分解して配列に
  const text_list = text.split('');
  //分解したものをaiueo配列に
  const aiueo_list = text_list.map(kana => kana_to_aiueo(kana));

  //配列を結合して元の文字列aiueoに
  const text_aiueo = aiueo_list.join('');

  //text_aiueoの文字列インデックスからaiueo_listインデックスへの変換テーブル
  //aiueo文字列のN番目は、text文字列のaiueo_text_index[N]番目に相当する
  let aiueo_text_index = [];
  for (let i = 0; i < aiueo_list.length; i++){
    if (aiueo_list[i].length > 0){
      aiueo_text_index.push(i);
    }
  }
  
  /*
  //アイドル名にマッチする部分を探す
  let idol_matches = {}
  for (let name in idol_aiueo){
    const aiueo = idol_aiueo[name];
    let matches = [];
    let start = 0;
    while (true){

      const match = text_aiueo.indexOf(aiueo, start);
      if (match < 0){
        break;
      }
      matches.push(match);
      start = match + 1;
    }
    idol_matches[name] = matches;

  }
  */

  //テキストを走査してマッチするアイドルを探す
  let matched_idols = [];
  for (let i = 0; i < text_aiueo.length; i++){
    let idol_names = [];
    for (let name in idol_aiueo){
      const aiueo = idol_aiueo[name];
      if (text_aiueo.indexOf(aiueo, i) == i){
        idol_names.push(`${name}<br>(${idol_aiueo[name]})`);
      }
    }
    matched_idols.push(idol_names);
  }


  //ＨＴＭＬを出力
  let html = '';
  let text_position = -1;
  let idols = [];
  for (let i = 0; i < matched_idols.length; i++){
    if (matched_idols[i].length < 1){
      continue;
    }
    
    if (text_position < 0){
      html += `<div class="text" style="float:left;">${text.slice(0, aiueo_text_index[i])}</div>`
      text_position = i;
      idols = matched_idols[i];
      continue;
    }
    
    html += `<div class="text" style="float:left;">${text.slice(aiueo_text_index[text_position], aiueo_text_index[i])}<br><div class="idol">${idols.join('<br>')}</div></div>`
    text_position = i;
    idols = matched_idols[i];
  }
  html += `<div class="text" style="float:left;">${text.slice(aiueo_text_index[text_position], aiueo_text_index[matched_idols.length])}<br><div class="idol">${idols.join('<br>')}</div></div>`
  document.getElementById('result').innerHTML = html;

}

function btn_click(){
  generate_in();
}

function init(){


}